blog-posts/2007-10-01-chapter-outline-draft-planning-your-day-in-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter outline draft: Planning your day in Emacs</title>
<!-- 2015-10-19 Mon 14:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Chapter outline draft: Planning your day in Emacs</h1>
<p>
October 1st, 2007 -
<a href="http://sachachua.com/blog/p/4374"><a href="http://sachachua.com/blog/p/4374">http://sachachua.com/blog/p/4374</a></a>
</p>

<p>
The first chapter I'm working on is about planning your schedule in
 Emacs. Here's my draft outline. I'm targetting 20 pages. The chapter
 before this is about managing tasks (35 pages). The Org and Planner
 sections in this chapter will build on the previous chapter, which I
 haven't written yet.
</p>

<pre class="example">
Audience:
  - do not keep track of schedule at all
  - track schedule using Outlook, Notes, or some other program
  - track schedule using PDA
  - track schedule using Filofax or other paper planner
  - already use Emacs and want to learn more tips

Why run your life in Emacs
Overview of methods
The basics
   Setting up Diary
   Getting reminders for appointments
   Importing an event
   Importing a calendar
   Exporting your calendar
   Publishing your calendar
   Synchronizing
Using Org
Using Planner
   Including Diary events
   Using tasks as appointments
      Sorting tasks by time
      Automatically updating a Diary section
      Keeping private Notes
   Publishing your schedule
Tracking Time
</pre>

<p>
Can you think of anything else that should go into it?
</p>

<p>
Random Emacs symbol: eshell-script-load-hook &#x2013; Variable: *A list of
functions to call when loading `eshell-script'.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
